app/controllers/articles_controller.rb

	def index
		@toindex = Article.all
---
SELECT "articles".* FROM "articles"