app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
	def home
		@toindex = Article.all.order("created_at DESC").paginate(page: params[:page], per_page:3)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "technology-2025795_1280.jpg"], ["image_updated_at", "2019-04-30 18:28:26.454607"], ["updated_at", "2019-04-30 18:28:27.085295"], ["id", 10]]
---
	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
	  @toform = Article.new(article_params)
	  if @toform.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
		@toshow = Article.find(params[:id])