app/controllers/welcome_controller.rb

  def index
  	@toindex = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY created_at